tutorials/incompressible/pimpleFoam/TJunction/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;       // 1cm - half channel height
        value           uniform 1;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }

    defaultFaces
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
